# Переменные и арифметические выражения
print(11+6)
print(11-6)
print(11*6)
print(11**6)
print(11//6) # целочисленное деление выводит целое число от деления
print(11%6) #остаток от деления

print((7-8)%24)

"""Нетрудно убедиться, что если -5 разделить на 2, то целая часть должна быть равна -3, а остаток равен 1. В некоторых других языках программирования остатки в такой ситуации могут быть отрицательными, что неправильно по математическим определениям."""


#vars
speed = 108
time = 12 
dist = speed*time
print(dist)