# Напишите программу, которая считывает два целых числа A и B и
# выводит наибольшее значение из них. Числа —  целые от 1 до 1000.

number1 = int(input())
number2 = int(input())

if number1 > number2:
    print(number1)
else:
    print(number2)
