# Вводится целое неотрицательное число N (N≤100).
# Выведите 2ᴺ.

num = int(input())
print(2**num)
