# Дано положительное двузначное число. Найдите число десятков в нем.

numb = int(input())
print(numb // 10)
