# Дано натуральное число. Выведите его последнюю цифру.

numb = int(input())
print(numb % 10)
