# Дана строка. Замените в этой строке все цифры 1 на слово one.
str = str(input())
# str = "dfa;sdkfj;ajva;bvna'sdasdfasdglJLHJKFHLDKJFh"
print(str.replace('@', ''), end='')
