# Дана строка, состоящая ровно из двух слов, разделенных пробелом. Переставьте
# эти слова местами. Результат запишите в строку и выведите получившуюся
# строку. При решении этой задачи нельзя пользоваться циклами и инструкцией
# if.
str = str(input())

words = str.count(' ')
print(words + 1)
