# Дано положительное действительное число X. Выведите
# его дробную часть.
n = float(input())
dr = n % 1
print('{0:6f}'.format(dr))
